# CAO Points Analysis

File include detailed comparison of CAO points in 2010, 2011, 2012, 2013, 2014, 2015, 2016, 2017, 2018, 2019, 2020 and 2021 using the functionality in Pandas, plus appropiate plots.

***

### Link to CAO Points Website
http://www.cao.ie/index.php?page=points&bb=mediastats

***

#### Imports of python libraries.

In [1]:
# Convinient package for making HTTP requests.
import requests as rq

# Regular expression.
import re

#Dates and times.
import datetime as dt

#To clean xlms and pdf files.
import pandas as pd

# For downloading.
import urllib.request as urlrq

## CAO Points 2021
***

### Link to CAO Points 2021 Website
https://www.cao.ie/index.php?/page=point&p=2021

***

***NOTE:***<br>
CAO Points 2021 file is available on the website, can be directy process.<br>
File is save on chosen localization with timestamp.

In [2]:
# Fetch CAO points from the website.
resp = rq.get("http://www2.cao.ie/points/l8.php")
# Check if its connecting.
resp

### Save original CAO Points 2021 data set to a HTML file. 

***

In [3]:
# Get the current date and time.
now = dt.datetime.now()
# Format as a string.
nowstr = now.strftime('%Y%m%d_%H%M%S')

In [4]:
# Creating timestamp in file as a filename itself.
pathhtml = 'data/cao2021_' + nowstr + '.html'

In [5]:
# Fixing wrong encoding that server is using. 
original_encoding = resp.encoding
# Change to cp1252
resp.encoding = 'cp1252'

In [6]:
# Save the original html file
with open(pathhtml, 'w') as f:
    f.write(resp.text)

### Use regular expression to select needed lines.

***

In [7]:
# Compile regular expression for matching lines.
re_course = re.compile(r'([A-Z]{2}[0-9]{3})(.*)')

### Loop through the lines of the response.
***

In [8]:
# Writing sorted CAO 2021 points data to a CSV file. 
path2021 = 'data/cao2021_csv_' + nowstr + '.csv'

In [9]:
# Keep track of how many courses we process.
no_lines = 0

# Open the csv file for writing.
with open(path2021, 'w') as f:
    # Write a header row.
    f.write(','.join(['code', 'title', 'pointsR1', 'pointsR2']) + '\n')
    # Loop through lines of the response.
    for line in resp.iter_lines():
        # Decode the line, using the wrong encoding!
        dline = line.decode('cp1252')
        # Match only the lines representing courses.
        if re_course.fullmatch(dline):
            # Add one to the lines counter.
            no_lines = no_lines + 1
            # The course code.
            course_code = dline[:5]
            # The course title.
            course_title = dline[7:57].strip()
            # Round one points.
            course_points = re.split(' +', dline[60:])
            if len(course_points) != 2:
                course_points = course_points[:2]
            # Join the fields using a comma.
            linesplit = [course_code, course_title, course_points[0], course_points[1]]
            # Rejoin the substrings with commas in between.
            f.write(','.join(linesplit) + '\n')

# Print the total number of processed lines.
print(f"Total number of lines is {no_lines}.")

Total number of lines is 949.

In [10]:
#Read in to Pandas csv file with 2021 Points
df2021 = pd.read_csv(path2021, encoding='cp1252')

In [11]:
# Show first 5 rows of data.
df2021.head()

    code                                              title pointsR1 pointsR2
0  AL801     Software Design for Virtual Reality and Gaming      300      NaN
1  AL802  Software Design in Artificial Intelligence for...      313      NaN
2  AL803  Software Design for Mobile Apps and Connected ...      350      NaN
3  AL805    Computer Engineering for Network Infrastructure      321      NaN
4  AL810                                 Quantity Surveying      328      NaN

## CAO Points 2020
***

### Link to CAO Points 2020 

http://www2.cao.ie/points/CAOPointsCharts2020.xlsx

***

***NOTE:***<br>
CAO Points 2020 file is available on the website as a ***xlsx*** file.<br>
File is save on chosen localization with timestamp.<br>
File is processes directly in the Pandas.

### Save Original File
***

In [12]:
# Create a file path for the original data.
pathxlsx = 'data/cao2020_' + nowstr + '.xlsx'

In [13]:
#Retrive CAO 2020 Points original xlsx file from website.
urlrq.urlretrieve('http://www2.cao.ie/points/CAOPointsCharts2020.xlsx', pathxlsx)

('data/cao2020_20211204_110003.xlsx',
 <http.client.HTTPMessage at 0x18cada50af0>)

### Load Spreadsheet using Pandas
***

In [14]:
# Download and parse the excel spreadsheet.
df2020 = pd.read_excel('http://www2.cao.ie/points/CAOPointsCharts2020.xlsx', skiprows=10)

In [15]:
# Show first 5 rows of data.
df2020.head()

,CATEGORY (i.e.ISCED description),COURSE TITLE,COURSE CODE2,R1 POINTS,R1 Random *,R2 POINTS,R2 Random*,EOS,EOS Random *,EOS Mid-point,...,avp,v,Column1,Column2,Column3,Column4,Column5,Column6,Column7,Column8
0,Business and administration,International Business,AC120,209,NaN,NaN,NaN,209,NaN,280,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,Humanities (except languages),Liberal Arts,AC137,252,NaN,NaN,NaN,252,NaN,270,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,Arts,"First Year Art & Design (Common Entry,portfolio)",AD101,#+matric,NaN,NaN,NaN,#+matric,NaN,#+matric,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,Arts,Graphic Design and Moving Image Design (portfo...,AD102,#+matric,NaN,NaN,NaN,#+matric,NaN,#+matric,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,Arts,Textile & Surface Design and Jewellery & Objec...,AD103,#+matric,NaN,NaN,NaN,#+matric,NaN,#+matric,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [16]:
# Spot check a random row.
df2020.iloc[753]

CATEGORY (i.e.ISCED description)          Engineering and engineering trades
COURSE TITLE                        Road Transport Technology and Management
COURSE CODE2                                                           LC286
R1 POINTS                                                                264
R1 Random *                                                              NaN
R2 POINTS                                                                NaN
R2 Random*                                                               NaN
EOS                                                                      264
EOS Random *                                                             NaN
EOS Mid-point                                                            360
LEVEL                                                                      7
HEI                                         Limerick Institute of Technology
Test/Interview #                                                         NaN
avp                                                                      NaN
v                                                                        NaN
Column1                                                                  NaN
Column2                                                                  NaN
Column3                                                                  NaN
Column4                                                                  NaN
Column5                                                                  NaN
Column6                                                                  NaN
Column7                                                                  NaN
Column8                                                                  NaN
Name: 753, dtype: object

In [17]:
# Spot check the last row.
df2020.iloc[-1]

CATEGORY (i.e.ISCED description)          Engineering and engineering trades
COURSE TITLE                        Mechanical and Manufacturing Engineering
COURSE CODE2                                                           WD230
R1 POINTS                                                                253
R1 Random *                                                              NaN
R2 POINTS                                                                NaN
R2 Random*                                                               NaN
EOS                                                                      253
EOS Random *                                                             NaN
EOS Mid-point                                                            369
LEVEL                                                                      8
HEI                                        Waterford Institute of Technology
Test/Interview #                                                         NaN
avp                                                                      NaN
v                                                                        NaN
Column1                                                                  NaN
Column2                                                                  NaN
Column3                                                                  NaN
Column4                                                                  NaN
Column5                                                                  NaN
Column6                                                                  NaN
Column7                                                                  NaN
Column8                                                                  NaN
Name: 1463, dtype: object

In [18]:
# Create a file path for the pandas data.
path = 'data/cao2020_' + nowstr + '.csv'

In [19]:
# Save pandas data frame to disk.
df2020.to_csv(path)

In [20]:
# Show first 5 rows of data.
df2020.head()

,CATEGORY (i.e.ISCED description),COURSE TITLE,COURSE CODE2,R1 POINTS,R1 Random *,R2 POINTS,R2 Random*,EOS,EOS Random *,EOS Mid-point,...,avp,v,Column1,Column2,Column3,Column4,Column5,Column6,Column7,Column8
0,Business and administration,International Business,AC120,209,NaN,NaN,NaN,209,NaN,280,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,Humanities (except languages),Liberal Arts,AC137,252,NaN,NaN,NaN,252,NaN,270,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,Arts,"First Year Art & Design (Common Entry,portfolio)",AD101,#+matric,NaN,NaN,NaN,#+matric,NaN,#+matric,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,Arts,Graphic Design and Moving Image Design (portfo...,AD102,#+matric,NaN,NaN,NaN,#+matric,NaN,#+matric,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,Arts,Textile & Surface Design and Jewellery & Objec...,AD103,#+matric,NaN,NaN,NaN,#+matric,NaN,#+matric,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

## CAO Points 2019
***

### Link CAO Points 2019 
https://www.cao.ie/index.php?page=points&p=2019
***

##### Preparation CAO 2019 pdf file for editing in Pandas ( steps)
- Downloading original file from the website - CAO Points 2019 - pdf file - lvl8_19.pdf  
- Open original pdf file in Microsoft Word.
- Save Microsoft Word's converted PDF in docx format.
- Re-save Word document for editing.
- Delete headers and footers.
- Delete preamble on page 1.
- Select all and copy.
- Paste into Notepad++.
- Remove HEI name headings and paste onto each course line.
- Delete blank lines.
- Replace " ` " to " ' ".
- Remove empty spaces at the end of the lines ( tabs, spaces)

***NOTE*** <br>
Above steps will be repeated for:
- CAO 2018 Points
- CAO 2017 Points
- CAO 2016 Points
- CAO 2015 Points
- CAO 2014 Points
- CAO 2013 Points
- CAO 2012 Points
- CAO 2011 Points
- CAO 2010 Points.

In [21]:
# Read CAO Points 2019 edited from csv (tsv) file to pandas.
df2019 = pd.read_csv("data/lvl8_19_20211115_1016_edited.csv", sep="\t")
# Show first 5 rows of data.
df2019.head()

,Institution,Code,Course,EOS,Mid
0,Athlone Institute of Technology,AL801,Software Design with Virtual Reality and Gaming,304,328.0
1,Athlone Institute of Technology,AL802,Software Design with Cloud Computing,301,306.0
2,Athlone Institute of Technology,AL803,Software Design with Mobile Apps and Connected...,309,337.0
3,Athlone Institute of Technology,AL805,Network Management and Cloud Infrastructure,329,442.0
4,Athlone Institute of Technology,AL810,Quantity Surveying,307,349.0

## CAO Points 2018
***

### Link CAO Points 2018
https://www.cao.ie/index.php?page=points&p=2018
***

##### Preparing CAO 2018 pdf file for editing in Pandas

In [22]:
# Read CAO Points 2018 edited from csv (tsv) file to pandas.
df2018 = pd.read_csv("data/CAO2018_20211115_edited.csv", sep="\t")
# Show first 5 rows of data.
df2018.head()

,Institution,Code,Course,EOS,Mid
0,Athlone Institute of Technology,AL801,Software Design (Game Development or Cloud Com...,295,326.0
1,Athlone Institute of Technology,AL810,Quantity Surveying,300,340.0
2,Athlone Institute of Technology,AL820,Mechanical and Polymer Engineering,299,371.0
3,Athlone Institute of Technology,AL830,General Nursing,418,440.0
4,Athlone Institute of Technology,AL832,Psychiatric Nursing,377,388.0

## CAO Points 2017
***

### Link CAO Points 2017
https://www.cao.ie/index.php?page=points&p=2017
***

##### Preparing CAO 2017 pdf file for editing in Pandas

In [23]:
# Read CAO Points 2017 edited from csv (tsv) file to pandas.
df2017 = pd.read_csv("data/CAO2017_edited.csv", sep="\t")
# Show first 5 rows of data.
df2017.head()

,Institution,Code,Course,EOS,Mid
0,Athlone Institute of Technology,AL801,Software Design (Game Development or Cloud Com...,290,329.0
1,Athlone Institute of Technology,AL810,Quantity Surveying,311,357.0
2,Athlone Institute of Technology,AL820,Mechanical and Polymer Engineering,300,336.0
3,Athlone Institute of Technology,AL830,General Nursing,398*,418.0
4,Athlone Institute of Technology,AL832,Psychiatric Nursing,378,389.0

## CAO Points 2016
***

### Link CAO Points 2016
https://www.cao.ie/index.php?page=points&p=2016
***

##### Preparing CAO 2016 pdf file for editing in Pandas

In [24]:
# Read CAO Points 2016 edited from csv (tsv) file to pandas.
df2016 = pd.read_csv("data/CAO2016_edited.csv", sep="\t")
# Show first 5 rows of data.
df2016.head()

,Institution,Code,Course,EOS,Mid
0,Athlone Institute of Technology,AL801,Software Design (Game Development or Cloud Com...,300,340.0
1,Athlone Institute of Technology,AL810,Quantity Surveying,315,355.0
2,Athlone Institute of Technology,AL820,Mechanical and Polymer Engineering,295,340.0
3,Athlone Institute of Technology,AL830,General Nursing,425*,440.0
4,Athlone Institute of Technology,AL831,Mature Applicants General Nursing,#181,185.0

## CAO Points 2015
***

### Link CAO Points 2015
https://www.cao.ie/index.php?page=points&p=2015
***

##### Preparing CAO 2015 pdf file for editing in Pandas

In [25]:
# Read CAO Points 2015 edited from csv (tsv) file to pandas.
df2015 = pd.read_csv("data/CAO2015_edited.csv", sep="\t")
# Show first 5 rows of data.
df2015.head()

,Institution,Code,Course,EOS,Mid
0,Athlone Institute of Technology,AL801,Software Design (Game Development or Cloud Com...,280,345.0
1,Athlone Institute of Technology,AL820,Mechanical and Polymer Engineering,315,355.0
2,Athlone Institute of Technology,AL830,General Nursing,420,435.0
3,Athlone Institute of Technology,AL831,Mature Applicants General Nursing,#176*,182.0
4,Athlone Institute of Technology,AL832,Psychiatric Nursing,390,400.0

## CAO Points 2014
***

### Link CAO Points 2014
https://www.cao.ie/index.php?page=points&p=2014
***

##### Preparing CAO 2014 pdf file for editing in Pandas

In [26]:
# Read CAO Points 2014 edited from csv (tsv) file to pandas.
df2014 = pd.read_csv("data/CAO2014_edited.csv", sep="\t")
# Show first 5 rows of data.
df2014.head()

,Institution,Code,Course,EOS,Mid
0,ATHLONE IT,AL801,Software Design (Common Entry,280,335
1,ATHLONE IT,AL820,Mechanical and Polymer Engineering ...,315,365
2,ATHLONE IT,AL830,General Nursing ...,410,420
3,ATHLONE IT,AL831,Mature Applicants General Nursing ...,#169,173
4,ATHLONE IT,AL832,Psychiatric Nursing ...,390,395

## CAO Points 2013
***

### Link CAO Points 2013
https://www.cao.ie/index.php?page=points&p=2013
***

##### Preparing CAO 2013 pdf file for editing in Pandas

In [27]:
# Read CAO Points 2013 edited from csv (tsv) file to pandas.
df2013 = pd.read_csv("data/CAO2013_edited.csv", sep="\t")
# Show first 5 rows od data.
df2013.head()

,Institution,Code,Course,EOS,Mid
0,ATHLONE IT,AL802,Software Design (Games Development) ...,275,325
1,ATHLONE IT,AL803,Software Design (Cloud Computing) ...,280,345
2,ATHLONE IT,AL830,General Nursing ...,410*,415
3,ATHLONE IT,AL831,Mature Applicants General Nursing ...,566#,581
4,ATHLONE IT,AL832,Psychiatric Nursing ...,395,400

## CAO Points 2012
***

### Link CAO Points 2012
https://www.cao.ie/index.php?page=points&p=2012
***

##### Preparing CAO 2012 pdf file for editing in Pandas

In [28]:
# Read CAO Points 2012 edited from csv (tsv) file to pandas.
df2012 = pd.read_csv("data/CAO2012_edited.csv", sep="\t")
# Show first 5 rows of data.
df2012.head()

,Institution,Code,Course,EOS,Mid
0,ATHLONE IT,AL802,Software Design (Games Development) ...,300,340
1,ATHLONE IT,AL803,Software Design (Web Development) ...,310,335
2,ATHLONE IT,AL805,Construction Technology and Management ...,NaN,NaN
3,ATHLONE IT,AL830,General Nursing ...,415*,430
4,ATHLONE IT,AL831,Mature Applicants General Nursing ...,233#,235

## CAO Points 2011
***

### Link CAO Points 2011
https://www.cao.ie/index.php?page=points&p=2011
***

##### Preparing CAO 2011 pdf file for editing in Pandas

In [29]:
# Read CAO Points 2011 edited from csv (tsv) file to pandas.
df2011 = pd.read_csv("data/CAO2011_edited.csv", sep="\t")
# Show first 5 rows of data.
df2011.head()

,Institution,Code,Course,EOS,Mid
0,ATHLONE IT,AL032,Software Design (Games Development) ...,285,330
1,ATHLONE IT,AL033,Toxicology ...,240,330
2,ATHLONE IT,AL034,Software Design (Web Development) ...,285,340
3,ATHLONE IT,AL035,Construction Technology and Management ...,265,315
4,ATHLONE IT,AL050,Business ...,270,325

## CAO Points 2010
***

### Link CAO Points 2010
https://www.cao.ie/index.php?page=points&p=2010
***

##### Preparing CAO 2010 pdf file for editing in Pandas

In [30]:
# Read CAO Points 2010 edited from csv (tsv) file to pandas.
df2010 = pd.read_csv("data/CAO2010_edited.csv", sep="\t")
# Show first 5 rows of data.
df2010.head()

,Institution,Code,Course,EOS,Mid
0,ATHLONE IT,AL032,Software Design (Games Development) ...,265 (375v),315
1,ATHLONE IT,AL033,Toxicology ...,280,345
2,ATHLONE IT,AL034,Software Design (Web Development) ...,270,300
3,ATHLONE IT,AL035,Construction Technology and Management ...,265,310
4,ATHLONE IT,AL050,Business ...,275,320

## Connecting CAO Points data from 2010-2021 files into one.
***

### Steps to create full data set with needed data:
- create new data frame containg only needed data:
        * code
        * title
        * points r1 for choosen years
        * points r2 for choosen years
- check for unique and clear duplicates
- clear  __*__  and  ***#***  using pandas
 

***

#### Merching data from different years.

In [31]:
#Take two columns from CAO 2021 data.
courses2021 = df2021[["code", "title"]]
# Check the columns and amount of rows.
courses2021

      code                                              title
0    AL801     Software Design for Virtual Reality and Gaming
1    AL802  Software Design in Artificial Intelligence for...
2    AL803  Software Design for Mobile Apps and Connected ...
3    AL805    Computer Engineering for Network Infrastructure
4    AL810                                 Quantity Surveying
..     ...                                                ...
944  WD211                                 Creative Computing
945  WD212                    Recreation and Sport Management
946  WD230           Mechanical and Manufacturing Engineering
947  WD231                 Early Childhood Care and Education
948  WD232                       Business Information Systems

[949 rows x 2 columns]

In [80]:
# Take two columns from CAO 2020 points.
courses2020 = df2020[["COURSE CODE2", "COURSE TITLE"]]
# Change the labels of columns.
courses2020.columns = ["code", "title"]
# Check the file after changes.
courses2020

       code                                              title
0     AC120                             International Business
1     AC137                                       Liberal Arts
2     AD101   First Year Art & Design (Common Entry,portfolio)
3     AD102  Graphic Design and Moving Image Design (portfo...
4     AD103  Textile & Surface Design and Jewellery & Objec...
...     ...                                                ...
1459  WD208                          Manufacturing Engineering
1460  WD210                       Software Systems Development
1461  WD211                                 Creative Computing
1462  WD212                    Recreation and Sport Management
1463  WD230           Mechanical and Manufacturing Engineering

[1464 rows x 2 columns]

### Creating list of all courses.

In [33]:
#Create new data frame with all data.
allcourses = pd.concat([courses2021, courses2020], ignore_index=True)
# Check new data.
allcourses

       code                                              title
0     AL801     Software Design for Virtual Reality and Gaming
1     AL802  Software Design in Artificial Intelligence for...
2     AL803  Software Design for Mobile Apps and Connected ...
3     AL805    Computer Engineering for Network Infrastructure
4     AL810                                 Quantity Surveying
...     ...                                                ...
2408  WD208                          Manufacturing Engineering
2409  WD210                       Software Systems Development
2410  WD211                                 Creative Computing
2411  WD212                    Recreation and Sport Management
2412  WD230           Mechanical and Manufacturing Engineering

[2413 rows x 2 columns]

In [34]:
# Sort values in the allcourses data.
allcourses.sort_values('code')

       code                                             title
175   AC120                            International Business
949   AC120                            International Business
950   AC137                                      Liberal Arts
176   AC137                                      Liberal Arts
951   AD101  First Year Art & Design (Common Entry,portfolio)
...     ...                                               ...
2411  WD212                   Recreation and Sport Management
2412  WD230          Mechanical and Manufacturing Engineering
946   WD230          Mechanical and Manufacturing Engineering
947   WD231                Early Childhood Care and Education
948   WD232                      Business Information Systems

[2413 rows x 2 columns]

In [35]:
# Check duplicates.
allcourses.loc[175]['title']

'International Business'

In [36]:
# Check duplicates.
allcourses.loc[949]['title']

'International Business'

In [37]:
#above discribe with strip in 2021

In [38]:
# Check all duplicates in data.
allcourses.duplicated()

0       False
1       False
2       False
3       False
4       False
        ...
2408    False
2409     True
2410     True
2411     True
2412     True
Length: 2413, dtype: bool

In [39]:
# Show all duplicates data.
allcourses[allcourses.duplicated()]

       code                                              title
949   AC120                             International Business
950   AC137                                       Liberal Arts
952   AD102  Graphic Design and Moving Image Design (portfo...
955   AD204                               Fine Art (portfolio)
956   AD211                         Fashion Design (portfolio)
...     ...                                                ...
2404  WD200                                     Arts (options)
2409  WD210                       Software Systems Development
2410  WD211                                 Creative Computing
2411  WD212                    Recreation and Sport Management
2412  WD230           Mechanical and Manufacturing Engineering

[739 rows x 2 columns]

In [40]:
# Returns a copy of the data frame with duplicates removed.
allcourses.drop_duplicates()

       code                                              title
0     AL801     Software Design for Virtual Reality and Gaming
1     AL802  Software Design in Artificial Intelligence for...
2     AL803  Software Design for Mobile Apps and Connected ...
3     AL805    Computer Engineering for Network Infrastructure
4     AL810                                 Quantity Surveying
...     ...                                                ...
2403  WD195  Architectural and Building Information Modelli...
2405  WD205   Molecular Biology with Biopharmaceutical Science
2406  WD206                             Electronic Engineering
2407  WD207                             Mechanical Engineering
2408  WD208                          Manufacturing Engineering

[1674 rows x 2 columns]

In [41]:
allcourses[allcourses.duplicated(subset=['code'])]

       code                                              title
949   AC120                             International Business
950   AC137                                       Liberal Arts
951   AD101   First Year Art & Design (Common Entry,portfolio)
952   AD102  Graphic Design and Moving Image Design (portfo...
953   AD103  Textile & Surface Design and Jewellery & Objec...
...     ...                                                ...
2404  WD200                                     Arts (options)
2409  WD210                       Software Systems Development
2410  WD211                                 Creative Computing
2411  WD212                    Recreation and Sport Management
2412  WD230           Mechanical and Manufacturing Engineering

[896 rows x 2 columns]

In [42]:
allcourses.drop_duplicates(subset=["code"], inplace=True, ignore_index=True)
allcourses

       code                                              title
0     AL801     Software Design for Virtual Reality and Gaming
1     AL802  Software Design in Artificial Intelligence for...
2     AL803  Software Design for Mobile Apps and Connected ...
3     AL805    Computer Engineering for Network Infrastructure
4     AL810                                 Quantity Surveying
...     ...                                                ...
1512  WD188                                Applied Health Care
1513  WD205   Molecular Biology with Biopharmaceutical Science
1514  WD206                             Electronic Engineering
1515  WD207                             Mechanical Engineering
1516  WD208                          Manufacturing Engineering

[1517 rows x 2 columns]

In [43]:
# Set the index to the code column.
df2021.set_index('code', inplace=True)
# Set columns as 'title', 'points_r1_2021', 'points_r2_2021'.
df2021.columns = ['title', 'points_r1_2021', 'points_r2_2021']

### JOINING data into one table.
***

#### All points in one table ( all 11 years )

In [44]:
# add columns with points to 'allcourses' table
# joining tables
# changing index for code column ( unique values)
allcourses.set_index('code', inplace=True)

In [45]:
# add points 2021 to table
allcourses = allcourses.join(df2021[['points_r1_2021']])
allcourses

                                                   title points_r1_2021
code
AL801     Software Design for Virtual Reality and Gaming            300
AL802  Software Design in Artificial Intelligence for...            313
AL803  Software Design for Mobile Apps and Connected ...            350
AL805    Computer Engineering for Network Infrastructure            321
AL810                                 Quantity Surveying            328
...                                                  ...            ...
WD188                                Applied Health Care            NaN
WD205   Molecular Biology with Biopharmaceutical Science            NaN
WD206                             Electronic Engineering            NaN
WD207                             Mechanical Engineering            NaN
WD208                          Manufacturing Engineering            NaN

[1517 rows x 2 columns]

In [46]:
# add points 2020 in the table 
df2020_r1 = df2020[['COURSE CODE2', 'R1 POINTS']]
df2020_r1.columns = ['code', 'points_R1_2020']
df2020_r1

       code points_R1_2020
0     AC120            209
1     AC137            252
2     AD101       #+matric
3     AD102       #+matric
4     AD103       #+matric
...     ...            ...
1459  WD208            188
1460  WD210            279
1461  WD211            271
1462  WD212            270
1463  WD230            253

[1464 rows x 2 columns]

In [47]:
df2020_r1.set_index('code', inplace=True)
df2020_r1

      points_R1_2020
code
AC120            209
AC137            252
AD101       #+matric
AD102       #+matric
AD103       #+matric
...              ...
WD208            188
WD210            279
WD211            271
WD212            270
WD230            253

[1464 rows x 1 columns]

In [48]:
# Join 2020 to allcourses.
allcourses = allcourses.join(df2020_r1)
allcourses

,title,points_r1_2021,points_R1_2020
code,,,
AL801,Software Design for Virtual Reality and Gaming,300,303
AL802,Software Design in Artificial Intelligence for...,313,332
AL803,Software Design for Mobile Apps and Connected ...,350,337
AL805,Computer Engineering for Network Infrastructure,321,333
AL810,Quantity Surveying,328,319
...,...,...,...
WD188,Applied Health Care,NaN,201
WD205,Molecular Biology with Biopharmaceutical Science,NaN,228
WD206,Electronic Engineering,NaN,179
WD207,Mechanical Engineering,NaN,198
WD208,Manufacturing Engineering,NaN,188

In [49]:
# add points 2019 in the table 
df2019_r1 = df2019[['Code', 'EOS']]
df2019_r1.columns = ['code', 'points_R1_2019']
df2019_r1

      code points_R1_2019
0    AL801            304
1    AL802            301
2    AL803            309
3    AL805            329
4    AL810            307
..     ...            ...
925  WD200            221
926  WD210            271
927  WD211            275
928  WD212            274
929  WD230            273

[930 rows x 2 columns]

In [50]:
# set the index 
df2019_r1.set_index('code', inplace=True)
df2019_r1

      points_R1_2019
code
AL801            304
AL802            301
AL803            309
AL805            329
AL810            307
...              ...
WD200            221
WD210            271
WD211            275
WD212            274
WD230            273

[930 rows x 1 columns]

In [51]:
# Join 2019 to allcourses.
allcourses = allcourses.join(df2019_r1)
allcourses.head()

,title,points_r1_2021,points_R1_2020,points_R1_2019
code,,,,
AL801,Software Design for Virtual Reality and Gaming,300,303,304
AL802,Software Design in Artificial Intelligence for...,313,332,301
AL803,Software Design for Mobile Apps and Connected ...,350,337,309
AL805,Computer Engineering for Network Infrastructure,321,333,329
AL810,Quantity Surveying,328,319,307

In [52]:
# add points 2018 in the table 
df2018_r1 = df2018[['Code', 'EOS']]
df2018_r1.columns = ['code', 'points_R1_2018']
df2018_r1.head()

    code points_R1_2018
0  AL801            295
1  AL810            300
2  AL820            299
3  AL830            418
4  AL832            377

In [53]:
# set the index 
df2018_r1.set_index('code', inplace=True)
df2018_r1.head()

      points_R1_2018
code
AL801            295
AL810            300
AL820            299
AL830            418
AL832            377

In [54]:
# Join 2018 to allcourses.
allcourses = allcourses.join(df2018_r1)
allcourses.head()

,title,points_r1_2021,points_R1_2020,points_R1_2019,points_R1_2018
code,,,,,
AL801,Software Design for Virtual Reality and Gaming,300,303,304,295
AL802,Software Design in Artificial Intelligence for...,313,332,301,NaN
AL803,Software Design for Mobile Apps and Connected ...,350,337,309,NaN
AL805,Computer Engineering for Network Infrastructure,321,333,329,NaN
AL810,Quantity Surveying,328,319,307,300

In [55]:
# add points 2017 in the table 
df2017_r1 = df2017[['Code', 'EOS']]
df2017_r1.columns = ['code', 'points_R1_2017']
df2017_r1.head()

    code points_R1_2017
0  AL801            290
1  AL810            311
2  AL820            300
3  AL830           398*
4  AL832            378

In [56]:
# set the index 
df2017_r1.set_index('code', inplace=True)
df2017_r1.head()

      points_R1_2017
code
AL801            290
AL810            311
AL820            300
AL830           398*
AL832            378

In [57]:
# Join 2017 to allcourses.
allcourses = allcourses.join(df2017_r1)
allcourses.head()

,title,points_r1_2021,points_R1_2020,points_R1_2019,points_R1_2018,points_R1_2017
code,,,,,,
AC120,International Business,294,209,234,269,281
AC137,Liberal Arts,271,252,252,219,219
AD101,First Year Art and Design (Common Entry portfo...,#554,#+matric,# +mat,#,NaN
AD102,Graphic Design and Moving Image Design (portfo...,#538,#+matric,# +mat,#,NaN
AD103,Textile and Surface Design and Jewellery and O...,#505,#+matric,# +mat,#,NaN

In [58]:
# add points 2016 in the table 
df2016_r1 = df2016[['Code', 'EOS']]
df2016_r1.columns = ['code', 'points_R1_2016']
df2016_r1.head()

    code points_R1_2016
0  AL801            300
1  AL810            315
2  AL820            295
3  AL830           425*
4  AL831           #181

In [59]:
# set the index 
df2016_r1.set_index('code', inplace=True)
df2016_r1.head()

      points_R1_2016
code
AL801            300
AL810            315
AL820            295
AL830           425*
AL831           #181

In [60]:
# Join 2016 to allcourses.
allcourses = allcourses.join(df2016_r1)
allcourses.head()

,title,points_r1_2021,points_R1_2020,points_R1_2019,points_R1_2018,points_R1_2017,points_R1_2016
code,,,,,,,
AC120,International Business,294,209,234,269,281,255
AC137,Liberal Arts,271,252,252,219,219,295
AD101,First Year Art and Design (Common Entry portfo...,#554,#+matric,# +mat,#,NaN,#407
AD102,Graphic Design and Moving Image Design (portfo...,#538,#+matric,# +mat,#,NaN,NaN
AD103,Textile and Surface Design and Jewellery and O...,#505,#+matric,# +mat,#,NaN,NaN

In [61]:
# add points 2015 in the table 
df2015_r1 = df2015[['Code', 'EOS']]
df2015_r1.columns = ['code', 'points_R1_2015']
df2015_r1.head()

    code points_R1_2015
0  AL801            280
1  AL820            315
2  AL830            420
3  AL831          #176*
4  AL832            390

In [62]:
# Set the index.
df2015_r1.set_index('code', inplace=True)
df2015_r1.head()

      points_R1_2015
code
AL801            280
AL820            315
AL830            420
AL831          #176*
AL832            390

In [63]:
# Join 2015 to allcourses.
allcourses = allcourses.join(df2015_r1)
allcourses.head()

,title,points_r1_2021,points_R1_2020,points_R1_2019,points_R1_2018,points_R1_2017,points_R1_2016,points_R1_2015
code,,,,,,,,
AC120,International Business,294,209,234,269,281,255,270
AC137,Liberal Arts,271,252,252,219,219,295,280
AD101,First Year Art and Design (Common Entry portfo...,#554,#+matric,# +mat,#,NaN,#407,#
AD102,Graphic Design and Moving Image Design (portfo...,#538,#+matric,# +mat,#,NaN,NaN,NaN
AD103,Textile and Surface Design and Jewellery and O...,#505,#+matric,# +mat,#,NaN,NaN,NaN

In [64]:
# Add points 2014 in the table.
df2014_r1 = df2014[['Code', 'EOS']]
df2014_r1.columns = ['code', 'points_R1_2014']
df2014_r1.head()

    code points_R1_2014
0  AL801            280
1  AL820            315
2  AL830            410
3  AL831           #169
4  AL832            390

In [65]:
# Set the index.
df2014_r1.set_index('code', inplace=True)
df2014_r1.head()

      points_R1_2014
code
AL801            280
AL820            315
AL830            410
AL831           #169
AL832            390

In [66]:
# Join 2014 to allcourses.
allcourses = allcourses.join(df2014_r1)
allcourses.head()

,title,points_r1_2021,points_R1_2020,points_R1_2019,points_R1_2018,points_R1_2017,points_R1_2016,points_R1_2015,points_R1_2014
code,,,,,,,,,
AC120,International Business,294,209,234,269,281,255,270,220
AC137,Liberal Arts,271,252,252,219,219,295,280,275
AD101,First Year Art and Design (Common Entry portfo...,#554,#+matric,# +mat,#,NaN,#407,#,#
AD102,Graphic Design and Moving Image Design (portfo...,#538,#+matric,# +mat,#,NaN,NaN,NaN,NaN
AD103,Textile and Surface Design and Jewellery and O...,#505,#+matric,# +mat,#,NaN,NaN,NaN,NaN

In [67]:
# Add points 2013 in the table.
df2013_r1 = df2013[['Code', 'EOS']]
df2013_r1.columns = ['code', 'points_R1_2013']
df2013_r1.head()

    code points_R1_2013
0  AL802            275
1  AL803            280
2  AL830           410*
3  AL831           566#
4  AL832            395

In [68]:
# Set the index.
df2013_r1.set_index('code', inplace=True)
df2013_r1.head()

      points_R1_2013
code
AL802            275
AL803            280
AL830           410*
AL831           566#
AL832            395

In [69]:
# Join 2013 to allcourses.
allcourses = allcourses.join(df2013_r1)
allcourses.head()

,title,points_r1_2021,points_R1_2020,points_R1_2019,points_R1_2018,points_R1_2017,points_R1_2016,points_R1_2015,points_R1_2014,points_R1_2013
code,,,,,,,,,,
AC120,International Business,294,209,234,269,281,255,270,220,285
AC137,Liberal Arts,271,252,252,219,219,295,280,275,200
AD101,First Year Art and Design (Common Entry portfo...,#554,#+matric,# +mat,#,NaN,#407,#,#,atriculate+
AD102,Graphic Design and Moving Image Design (portfo...,#538,#+matric,# +mat,#,NaN,NaN,NaN,NaN,NaN
AD103,Textile and Surface Design and Jewellery and O...,#505,#+matric,# +mat,#,NaN,NaN,NaN,NaN,NaN

In [70]:
# Add points 2012 in the table.
df2012_r1 = df2012[['Code', 'EOS']]
df2012_r1.columns = ['code', 'points_R1_2012']
df2012_r1.head()

    code points_R1_2012
0  AL802            300
1  AL803            310
2  AL805            NaN
3  AL830           415*
4  AL831           233#

In [71]:
# Set the index.
df2012_r1.set_index('code', inplace=True)
df2012_r1.head()

      points_R1_2012
code
AL802            300
AL803            310
AL805            NaN
AL830           415*
AL831           233#

In [72]:
# Join 2012 to allcourses.
allcourses = allcourses.join(df2012_r1)
allcourses.head()

,title,points_r1_2021,points_R1_2020,points_R1_2019,points_R1_2018,points_R1_2017,points_R1_2016,points_R1_2015,points_R1_2014,points_R1_2013,points_R1_2012
code,,,,,,,,,,,
AC120,International Business,294,209,234,269,281,255,270,220,285,295
AC137,Liberal Arts,271,252,252,219,219,295,280,275,200,280
AD101,First Year Art and Design (Common Entry portfo...,#554,#+matric,# +mat,#,NaN,#407,#,#,atriculate+,NaN
AD102,Graphic Design and Moving Image Design (portfo...,#538,#+matric,# +mat,#,NaN,NaN,NaN,NaN,NaN,NaN
AD103,Textile and Surface Design and Jewellery and O...,#505,#+matric,# +mat,#,NaN,NaN,NaN,NaN,NaN,NaN

In [73]:
# Add points 2011 in the table.
df2011_r1 = df2011[['Code', 'EOS']]
df2011_r1.columns = ['code', 'points_R1_2011']
df2011_r1.head()

    code points_R1_2011
0  AL032            285
1  AL033            240
2  AL034            285
3  AL035            265
4  AL050            270

In [74]:
# Set the index.
df2011_r1.set_index('code', inplace=True)
df2011_r1.head()

      points_R1_2011
code
AL032            285
AL033            240
AL034            285
AL035            265
AL050            270

In [75]:
# Join 2011 to allcourses.
allcourses = allcourses.join(df2011_r1)
allcourses.head()

,title,points_r1_2021,points_R1_2020,points_R1_2019,points_R1_2018,points_R1_2017,points_R1_2016,points_R1_2015,points_R1_2014,points_R1_2013,points_R1_2012,points_R1_2011
code,,,,,,,,,,,,
AC120,International Business,294,209,234,269,281,255,270,220,285,295,280
AC137,Liberal Arts,271,252,252,219,219,295,280,275,200,280,NaN
AD101,First Year Art and Design (Common Entry portfo...,#554,#+matric,# +mat,#,NaN,#407,#,#,atriculate+,NaN,NaN
AD102,Graphic Design and Moving Image Design (portfo...,#538,#+matric,# +mat,#,NaN,NaN,NaN,NaN,NaN,NaN,NaN
AD103,Textile and Surface Design and Jewellery and O...,#505,#+matric,# +mat,#,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [76]:
# Add points 2010 in the table.
df2010_r1 = df2010[['Code', 'EOS']]
df2010_r1.columns = ['code', 'points_R1_2010']
df2010_r1.head()

    code points_R1_2010
0  AL032     265 (375v)
1  AL033            280
2  AL034            270
3  AL035            265
4  AL050            275

In [77]:
# Set the index.
df2010_r1.set_index('code', inplace=True)
df2010_r1.head()

      points_R1_2010
code
AL032     265 (375v)
AL033            280
AL034            270
AL035            265
AL050            275

In [78]:
# Join 2010 to allcourses.
allcourses = allcourses.join(df2010_r1)
allcourses.head()

,title,points_r1_2021,points_R1_2020,points_R1_2019,points_R1_2018,points_R1_2017,points_R1_2016,points_R1_2015,points_R1_2014,points_R1_2013,points_R1_2012,points_R1_2011,points_R1_2010
code,,,,,,,,,,,,,
AC120,International Business,294,209,234,269,281,255,270,220,285,295,280,305
AC137,Liberal Arts,271,252,252,219,219,295,280,275,200,280,NaN,NaN
AD101,First Year Art and Design (Common Entry portfo...,#554,#+matric,# +mat,#,NaN,#407,#,#,atriculate+,NaN,NaN,NaN
AD102,Graphic Design and Moving Image Design (portfo...,#538,#+matric,# +mat,#,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
AD103,Textile and Surface Design and Jewellery and O...,#505,#+matric,# +mat,#,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

### Cleaning data from "*" and "#".

In [79]:
# Replace unwanted characters in whole data set.
allcourses=allcourses.replace(['\*', '\#'],'',regex=True)
# Checking random lines.
allcourses.iloc[50:100]

,title,points_r1_2021,points_R1_2020,points_R1_2019,points_R1_2018,points_R1_2017,points_R1_2016,points_R1_2015,points_R1_2014,points_R1_2013,points_R1_2012,points_R1_2011,points_R1_2010
code,,,,,,,,,,,,,
AL811,Civil Engineering,NaN,320,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
AL820,Mechanical and Polymer Engineering,327,308,300,299,300,295,315,315,NaN,NaN,NaN,NaN
AL830,General Nursing,451,442,410,418,398,425,420,410,410,415,NaN,NaN
AL832,Mental Health Nursing,440,387,387,377,378,375,390,390,395,395,NaN,NaN
AL835,Pharmacology,356,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,405,NaN,NaN
AL836,Nutrition and Health Science,346,334,352,354,346,350,365,390,395,375,NaN,NaN
AL837,Sports Science with Exercise Physiology,357,351,351,346,354,360,370,380,400,360,375,NaN
AL838,Biotechnology,324,307,302,301,270,270,285,295,275,270,NaN,NaN
AL839,Microbiology,325,325,322,318,318,NaN,NaN,NaN,275,275,NaN,NaN
AL840,Pharmaceutical Sciences,346,347,328,312,257,255,260,275,270,260,NaN,NaN
AL841,Athletic and Rehabilitation Therapy,477,430,423,402,405,410,400,395,420,365,NaN,NaN
AL842,Bioveterinary Science,338,313,310,304,301,325,325,340,NaN,NaN,NaN,NaN
AL843,Physical Activity and Health Science,306,306,310,317,306,345,NaN,NaN,NaN,NaN,NaN,NaN
AL849,Culinary Entrepreneurship,297,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
AL850,Business,309,309,307,308,296,300,300,295,285,270,NaN,NaN
AL851,Business and Law,302,295,301,300,300,300,300,270,270,270,NaN,NaN
AL852,Accounting,336,309,290,306,293,290,305,310,340,295,NaN,NaN
AL854,Sport Management (with international placement),300,302,NaN,NaN,291,305,300,295,NaN,NaN,NaN,NaN
AL855,Hospitality Management (with international pla...,309,308,312,310,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
AL857,Digital Marketing,304,304,300,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
AL859,International Business,308,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
AL860,Social Care Practice,301,300,309,300,300,300,310,320,325,340,NaN,NaN
AL861,Animation and Illustration (portfolio),575,578,615,789,605,565,NaN,NaN,NaN,NaN,NaN,NaN
AL863,Graphic and Digital Design (portfolio),747,781,703,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
AL864,Early Years Care and Education,306,307,307,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
AL870,Applied Psychology,484,418,409,366,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
AS001,Education Home Economics and Biology - with c...,542,510,456,462,473,465,490,510,480,500,500,480
AS002,Education Home Economics and Religious Ed - with,464,441,400,433,419,420,440,440,435,450,470,460
AS003,Education Home Economics and Irish - with con...,463,440,421,409,398,425,375,410,455,480,455,440
AS051,Nutrition Food and Business Management,378,328,337,252,243,360,270,265,220,270,305,NaN
AS054,Home Economics,440,408,387,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
AS110,General Nursing,440,419,391,388,387,405,405,405,405,410,400,395
AS130,Intellectual Disability Nursing,387,336,317,328,307,350,355,370,365,375,365,350
BY001,Business,210,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
CI001,Counselling Skills and Psychotherapy Studies,NaN,300,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
CI002,Counselling Skills and Addiction Studies,NaN,309,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
CI005,Counselling Skills and Youth Studies,NaN,306,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
CI110,Counselling and Psychotherapy,292,310,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
CI111,Counselling and Psychotherapy with Addiction S...,290,301,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
CI112,Counselling and Psychotherapy with Youth Studies,325,311,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
CK101,Arts - 3 years,300,300,300,300,330,350,350,345,330,330,345,350
CK102,Social Science,434,412,391,387,378,420,435,405,380,390,385,390
CK104,Arts with Music - 3 or 4 years (BMus or Chines...,339,302,340,368,367,390,410,390,340,335,410,445
CK105,Film and Screen Media - 3 years or 4 years (In...,421,368,397,400,422,430,450,450,420,NaN,NaN,NaN
CK107,Geographical and Archaeological Sciences - 3 or 4,312,328,326,318,337,330,340,340,355,NaN,NaN,NaN
CK108,Arts International - 4 years,440,401,429,423,466,465,475,455,430,NaN,NaN,NaN
CK109,English - 3 years or 4 years (International Pa...,367,318,347,355,420,400,410,415,NaN,NaN,NaN,NaN
CK110,World Languages,488,452,456,452,476,470,495,460,NaN,NaN,NaN,NaN
CK111,Early Years and Childhood Studies,409,419,398,388,377,385,390,380,395,395,400,395
CK112,Theatre and Performative Practices - 3 or 4 years,371,330,324,334,408,325,315,365,375,355,400,370

### REFERENCES:
    1.
    2.
    3.